# GetColorFillSchemeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetColorFillSchemeId Method
View Class See Also
---
Returns id of the color fill scheme element applied to the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId GetColorFillSchemeId(
	ElementId categoryId
)
```

Visual Basic
---
```text
Public Function GetColorFillSchemeId ( _
	categoryId As ElementId _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetColorFillSchemeId(
	ElementId^ categoryId
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..ElementId The id of the category which the color fill scheme element belongs to.
# ### Return Value
The id of the color fill scheme element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View Class
Autodesk.Revit.DB Namespace